[
  {
    "id": "qr-val-001",
    "type": "validation",
    "title": "Conectando Viñedos",
    "question": "¿Qué medida implementarías si una empresa de vinos y viñedos tiene la necesidad de integrar y conectar los procesos internos?",
    "placeholder": "Piensa en tecnologías como IoT, software de gestión (ERP), sensores en el campo, o incluso blockchain para la trazabilidad.",
    "criteria": "Se evaluará la coherencia de la solución propuesta, su viabilidad y el nivel de innovación. La respuesta debe ser más que una simple tecnología; debe ser una solución a un problema. Según tu rol, se valorará especialmente: la aplicación de modelos predictivos (Experto en IA), la conexión con proveedores tecnológicos locales (Agente Territorial), la definición de un modelo de negocio escalable (Inversor Visionario) o la propuesta de una plataforma de colaboración (Conector del Ecosistema)."
  },
  {
    "id": "qr-val-002",
    "type": "validation",
    "title": "Gigantes de Teruel",
    "question": "¿Qué empresa famosa de Teruel ha tenido la necesidad del desarrollo de un vehículo nuevo?",
    "placeholder": "Pista: No es una empresa de coches. Piensa en grandes industrias y sus necesidades de transporte especializado en la provincia.",
    "criteria": "El criterio principal es la identificación de la empresa correcta (Grupo Térvalis / Fertinagro) y la comprensión de su contexto industrial. La flexibilidad radica en la justificación. Un 'Agente Territorial' o 'Conector del Ecosistema' debería conocer la respuesta y su contexto. Otros roles, como el 'Ciudadano Innovador', pueden ser valorados por su capacidad de deducir el tipo de industria y necesidad, aunque no conozcan el nombre exacto."
  },
  {
    "id": "qr-val-003",
    "type": "validation",
    "title": "Mochila Digital Rural",
    "question": "Crea una “mochila digital” con tres tecnologías para un joven aragonés que quiere emprender en el mundo rural.",
    "placeholder": "Elige herramientas concretas. Piensa en conectividad, gestión de negocio, marketing digital, etc.",
    "criteria": "Se valorará la elección de tres tecnologías o herramientas y la justificación de cómo estas se combinan para potenciar un negocio rural en Aragón. No hay una combinación única correcta. Se espera un enfoque distinto según el rol: práctico y de bajo coste (Joven Talento), centrado en la colaboración y gestión (Facilitador de Innovación), o enfocado en crear una marca potente y visual (Diseñador Flash)."
  },
  {
    "id": "qr-val-004",
    "type": "validation",
    "title": "AgroTech Aragonés",
    "question": "Diseña una idea tecnológica e innovadora para mejorar y optimizar los cultivos en Aragón.",
    "placeholder": "Puedes pensar en drones, sensores, IA para predecir cosechas, o plataformas para conectar agricultores directamente con consumidores.",
    "criteria": "Se evaluará la originalidad, viabilidad y el potencial impacto de la idea en la agricultura aragonesa. La flexibilidad se encuentra en la diversidad de soluciones. Se valorará especialmente: la profundidad técnica de la propuesta (Experto en IA), la conexión con recursos y cultivos específicos del territorio (Agente Territorial), el diseño de un modelo de negocio sostenible (Inversor Visionario), o la solución a un problema social/ambiental (Hacker Ético)."
  },
  {
    "id": "qr-val-005",
    "type": "validation",
    "title": "Fiestas del Pilar 2.0",
    "question": "Desarrolla una solución tecnológica para mejorar la experiencia en eventos como las Fiestas del Pilar u otros.",
    "placeholder": "Piensa en problemas reales: aglomeraciones, encontrar eventos, participación, seguridad, accesibilidad...",
    "criteria": "Se evaluará la capacidad de identificar un problema real en un evento masivo y proponer una solución tecnológica centrada en el usuario. Se espera que sea creativa y factible. El enfoque puede variar: mejorar la seguridad y logística (Hacker Ético), enriquecer la experiencia cultural con realidad aumentada (Diseñador Flash), fomentar la participación con gamificación (Joven Talento), o mejorar la accesibilidad para todos (Ciudadano Innovador)."
  }
]